turumputum/moduleBox/bootldsd/loader/sdkconfig.defaults
# bootldsd (loader) - загрузчик обновлений moduleBox. Минимальная конфигурация: без Wi-Fi/BT/PSRAM,
# одно ядро, оптимизация по размеру - раздел bootldsd всего 256K (0x10000..0x50000).
CONFIG_IDF_TARGET="esp32s3"

# Flash - как у основного проекта
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Таблица разделов - единая с основным проектом (корень репозитория)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Размер
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_FREERTOS_UNICORE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# Стирание и запись 2-3 МБ идут из app_main без переключений - task WDT
# (следит за idle) только зря ругался бы; аварийную защиту даёт RTC WDT bootloader'а
CONFIG_ESP_TASK_WDT_INIT=n

# Формат раздела storage должен совпадать с основной прошивкой (main/main.c, /int):
# WL сектор 4096, FATFS сектор 4096, кодовая страница 866, длинные имена в куче
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_FATFS_SECTOR_4096=y
CONFIG_FATFS_CODEPAGE_866=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_VOLUME_COUNT=1
CONFIG_FATFS_IMMEDIATE_FSYNC=y
